Revit 2015 API
Units.SetDecimalSymbolAndGrouping Method
 Sets the decimal symbol and digit grouping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015.  Use the setters for DecimalSymbol, DigitGroupingSymbol, and DigitGroupingAmount instead.")]
public void SetDecimalSymbolAndGrouping(
	DecimalSymbol decimalSymbol,
	DigitGroupingSymbol digitGroupingSymbol,
	DigitGroupingAmount digitGroupingAmount
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015.  Use the setters for DecimalSymbol, DigitGroupingSymbol, and DigitGroupingAmount instead.")> _
Public Sub SetDecimalSymbolAndGrouping ( _
	decimalSymbol As DecimalSymbol, _
	digitGroupingSymbol As DigitGroupingSymbol, _
	digitGroupingAmount As DigitGroupingAmount _
)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015.  Use the setters for DecimalSymbol, DigitGroupingSymbol, and DigitGroupingAmount instead.")]
public:
void SetDecimalSymbolAndGrouping(
	DecimalSymbol decimalSymbol,
	DigitGroupingSymbol digitGroupingSymbol,
	DigitGroupingAmount digitGroupingAmount
)
Parameters
decimalSymbol
Type: Autodesk.Revit.DB.DecimalSymbol
 The decimal symbol.
digitGroupingSymbol
Type: Autodesk.Revit.DB.DigitGroupingSymbol
 The digit grouping symbol.
digitGroupingAmount
Type: Autodesk.Revit.DB.DigitGroupingAmount
 The number of digits in each group.
Remarks
 This method is equivalent to setting the DecimalSymbol, DigitGroupingSymbol, and DigitGroupingAmount properties. For details, see the documentation for those properties.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Units Class
Autodesk.Revit.DB Namespace